


<template>
    <div class="main">
        <section class="m-36 p-auto  text-center">
            <h1 class="lg:text-8xl text-xl font-semibold text-volna">Контакты</h1>
        </section>
        <div class="box lg:flex">
            <div class="first   mx-auto lg:w-1/2">
                <h1 class="lg:text-2xl font-semibold uppercase text-white  p-1 m-3">
                    Мы находимся в городе: <p class="text-3xl m-1 text-volna font-medium">Алматы</p> 
                </h1>
                <p class="lg:text-2xl uppercase font-semibold text-white p-1 m-2">
                    контактный номер:   
                </p>
                <a class="text-white text-xl hover:underline hover:text-volna text-center ml-4 " href="tel:+77071033382">
                    +7 707 103 33 82
                </a>
                <p class="lg:text-2xl uppercase font-semibold text-white p-1 m-2">
                    Наши соц сети:
                </p>
                <section class="icons  mb-12 w-1/3  flex ">
                  <a class="ml-3 text-white hover:text-volna">
                      <svg fill="none" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" class="w-6 h-6" viewBox="0 0 24 24">
                        <rect width="20" height="20" x="2" y="2" rx="5" ry="5"></rect>
                        <path d="M16 11.37A4 4 0 1112.63 8 4 4 0 0116 11.37zm1.5-4.87h.01"></path>
                      </svg>
                  </a>
                  <a class="text-white ml-3 " href="">
                    <svg width="30" height="30" class="w-6 h-6" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                         <path fill-rule="evenodd" clip-rule="evenodd" d="M5.43947 4.80999C9.07045 1.50022 14.5968 1.40916 18.3349 4.5975C22.073 7.78584 22.8547 13.2574 20.1591 17.365C17.5693 21.3115 12.5468 22.8142 8.24335 21.0099L7.946 20.8788L3.13159 21.7371L3.0302 21.7482L2.99254 21.7489L2.89484 21.7415L2.83385 21.7303L2.79737 21.721L2.74096 21.7027L2.65298 21.6637L2.61067 21.6399L2.57095 21.6139L2.4959 21.5541L2.45699 21.5164L2.42886 21.485L2.39485 21.442L2.37088 21.4074L2.323 21.3219L2.28623 21.2293L2.27287 21.1827L2.26164 21.1303L2.25052 21.029L2.24985 20.9913L2.25722 20.8936L2.26844 20.8326L2.2778 20.7961L2.29603 20.7397L3.799 17.2758L3.71377 17.1418C1.31144 13.2607 1.9262 8.20312 5.22525 5.01117L5.43947 4.80999ZM17.3615 5.73875C14.1985 3.04092 9.52233 3.11798 6.44996 5.91855C3.37759 8.71913 2.86898 13.3682 5.26314 16.7668C5.39226 16.9501 5.43154 17.1797 5.37452 17.3927L5.33795 17.4975L4.244 20.0148L7.91841 19.3604C8.036 19.3394 8.15629 19.347 8.26943 19.3816L8.37981 19.4252C12.1135 21.2533 16.6242 20.0177 18.9051 16.542C21.186 13.0664 20.5244 8.43658 17.3615 5.73875ZM10.7436 8.87095C10.6795 8.24063 10.1472 7.74875 9.5 7.74875C8.80965 7.74875 8.25 8.3084 8.25 8.99875V9.99875L8.25416 10.2193C8.37007 13.2927 10.8982 15.7488 14 15.7488H15L15.1278 15.7423C15.7581 15.6783 16.25 15.146 16.25 14.4988C16.25 13.8084 15.6904 13.2488 15 13.2488H14L13.8722 13.2552C13.41 13.3022 13.0222 13.6009 12.8482 14.0122L12.822 14.0828L12.5903 14.0094C11.3057 13.5579 10.3036 12.5067 9.91976 11.1919L9.915 11.1758L9.98656 11.1505C10.4352 10.9608 10.75 10.5165 10.75 9.99875V8.99875L10.7436 8.87095Z" fill="#212121"/>
                    </svg>
                  </a>
                  <a class="text-white ml-3" href="">
                    <svg width="30" height="30" stroke="currentColor" class="w-6 h-6" stroke-width="2" viewBox="0 0 20 18" fill="none" xmlns="http://www.w3.org/2000/svg">
<path fill-rule="evenodd" clip-rule="evenodd" d="M18.7282 0.30236C19.262 0.0947757 19.807 0.535308 19.7463 1.08004L19.7276 1.18327L15.7276 17.1833C15.5951 17.7135 14.9677 17.9181 14.5502 17.6019L14.4697 17.5317L10.081 13.1434L7.6 16.4514C7.25969 16.9051 6.57292 16.8255 6.33076 16.3408L6.28849 16.2385L4.386 10.5324L0.664592 8.67218C0.116948 8.39836 0.119395 7.63543 0.627069 7.35004L0.728168 7.30236L18.7282 0.30236ZM17.92 2.22536L2.848 8.08736L5.33541 9.33054C5.47774 9.40171 5.59279 9.51577 5.66533 9.65517L5.71151 9.76419L7.259 14.4064L9.01 12.0724L8.46967 11.5317C8.20341 11.2654 8.1792 10.8488 8.39705 10.5552L8.46967 10.471L12.4697 6.47103C12.7626 6.17814 13.2374 6.17814 13.5303 6.47103C13.7966 6.7373 13.8208 7.15396 13.603 7.44758L13.5303 7.53169L10.061 11.0014L14.593 15.5334L17.92 2.22536Z" fill="#212121"/>
</svg>

                  </a>
                 </section>
               
            </div>
            <div class="second w-1/2"></div>
        </div>
    </div>
</template>

<style scoped>

.box {
  border: 2px solid #2EECC5;

}
.first {
  border: 1px solid blue;

}


</style> 